hql2017/NR_BLDC/project/at_start_f413/zcl_0729_V4/mdk_v5/.pack/ArteryTek/AT32F413_DFP.2.0.6/ArteryTek.AT32F413_DFP.pdsc
        <!-- *************************  Device 'AT32F413TBU7'  ***************************** -->
        <device Dname="-AT32F413TBU7">
          <compile header="Device/Include/at32f413.h"  define="AT32F413TBU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F413_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F413_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F413KBU7-4'  ***************************** -->
        <device Dname="-AT32F413KBU7-4">
          <compile header="Device/Include/at32f413.h"  define="AT32F413KBU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F413_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F413_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F413KCU7-4'  ***************************** -->
        <device Dname="-AT32F413KCU7-4">
          <compile header="Device/Include/at32f413.h"  define="AT32F413KCU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F413_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F413_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F413CBU7'  ***************************** -->
        <device Dname="-AT32F413CBU7">
          <compile header="Device/Include/at32f413.h"  define="AT32F413CBU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F413_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F413_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>

