hql2017/NR_BLDC/project/at_start_f413/zcl_0729_V4/mdk_v5/.pack/ArteryTek/AT32F413_DFP.2.0.6/ArteryTek.AT32F413_DFP.pdsc
    <condition id="AT32F413">
      <description>ArteryTek AT32F413 Devices</description>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32FEBKxx"/>
    </condition>

    <!-- Series id Conditions -->
    <condition id="AT32F413xx ARMCC">
      <description>ArteryTek AT32F413xx Series devices</description>
      <accept condition="AT32F413"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="AT32F413 CMSIS">
      <description>ArteryTek AT32F413 Devices and CMSIS-CORE</description>
      <require condition="AT32F413"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="at32f413_conf"/>    
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="crm"/>           
    </condition>

    <!-- AT32F413 STDPERIPHERALS CRM Conditions -->
    <condition id="AT32F413 STDPERIPHERALS CRM">
      <description>ArteryTek AT32F413 Standard Peripherals Drivers with CRM</description>
      <require condition="AT32F413 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="crm"/>
    </condition>

     <!-- AT32F413 STDPERIPHERALS MISC Conditions -->
    <condition id="AT32F413 STDPERIPHERALS MISC">
      <description>ArteryTek  AT32F413 Standard Peripherals Drivers with MISC</description>
      <require condition="AT32F413 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="misc"/>
    </condition>

     <!-- AT32F413 STDPERIPHERALS EVAL Conditions -->
    <condition id="AT32F413 STDPERIPHERALS EVB">
      <description>ArteryTek AT32F413 Standard Peripherals Drivers with EVB</description>
      <require condition="AT32F413 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="at32f413_firmware_library" Csub="usart"/>
    </condition>
  </conditions>

  <components>
  <!-- at32f413_firmware_library -->

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="adc" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_adc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="bpr" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Battery Powered Register (BPR) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BPR
        </RTE_Components_h>
        <files>
          <!-- BPR file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_bpr.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_bpr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="crc" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_crc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="crm" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
        </RTE_Components_h>
        <files>
          <!-- CRM file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_crm.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_crm.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="debug" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
        </RTE_Components_h>
        <files>
          <!-- DEBUG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_debug.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_debug.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="dma" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_dma.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="exint" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
        </RTE_Components_h>
        <files>
          <!-- EXINT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_exint.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_exint.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="flash" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
        </RTE_Components_h>
        <files>
          <!-- FLASH file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_flash.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_flash.c" attr="config" version="2.0.0" />
        </files>
    </component>

