hql2017/NR_BLDC/project/at_start_f413/zcl_0729_V4/mdk_v5/.pack/ArteryTek/AT32F413_DFP.2.0.6/ArteryTek.AT32F413_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="gpio" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_gpio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="i2c" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_i2c.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="misc" Cversion="2.0.0" condition="AT32F413 CMSIS">
      <description>MISC driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_misc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="pwc" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
        </RTE_Components_h>
        <files>
          <!-- PWC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_pwc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_pwc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="rtc" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Real-time Clock (RTC) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_rtc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="sdio" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>SD/SDIO MMC card host interface (SDIO) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_sdio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="spi" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_spi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="tmr" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>TIMER driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
        </RTE_Components_h>
        <files>
          <!-- TIMER file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_tmr.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_tmr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="usart" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_usart.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="usb" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
        </RTE_Components_h>
        <files>
          <!-- USB file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_usb.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_usb.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="wdt" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
        </RTE_Components_h>
        <files>
          <!-- WDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_wdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_wdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f413_firmware_library" Csub="wwdt" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for AT32F413 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
        </RTE_Components_h>
        <files>
          <!-- WWDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f413_wwdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f413_wwdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

