hql2017/NR_BLDC/project/at_start_f413/zcl_0729_V4/mdk_v5/.pack/ArteryTek/AT32F413_DFP.2.0.6/ArteryTek.AT32F413_DFP.pdsc
    <!-- Utilities AT32F413 -->
    <component Cclass="Device" Cgroup="evb" Csub="at-start-f413" Cversion="2.0.0" condition="AT32F413 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/at32f413_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/at32f413_board.c" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Config AT32F413 -->
    <component Cclass="Device" Cgroup="at32f413_conf" Cversion="2.0.0" condition="AT32F413 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/at32f413_conf.h" attr="config" version="2.0.0"/>
      </files>
    </component>

   <!-- Startup AT32F413  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.0" condition="AT32F413">
      <description>System Startup for ArteryTek AT32F413  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/at32f413.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_at32f413.s" attr="config" version="2.0.0" condition="AT32F413xx ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_at32f413.c"      attr="config" version="2.0.0"/>
      </files>
    </component>
  </components>
</package>
